v2206/multiphase_condensatinVessel/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.liquid 0
    // volScalarFieldValue alpha.vapour 1
    volScalarFieldValue T 370
);

regions
(
    boxToCell
    {
        box (0.00   0.00   0.00) (0.002  0.005   0.01);
        fieldValues
        (
            volScalarFieldValue alpha.liquid 1
            // volScalarFieldValue alpha.vapour 0
            volScalarFieldValue T 360
        );
    }
    // boxToCell
    // {
    //     box (0.4   -0.20   0.00) (0.60  0.00   0.10);
    //     fieldValues
    //     (
    //         volScalarFieldValue alpha.lightFluid 0
    //         volScalarFieldValue alpha.denseFluid 1
    //         volScalarFieldValue T 250
    //     );
    // }
);


// ************************************************************************* //
